In [ ]:
'''
Data Science BI suit
   SQL - data store and retrieve
   ETL - transfer and manipulate data
   Tableau -  Visualization
   Data Science - Predict pattern
'''

In [1]:
import pandas as pd  #import Panda library

# View Sample

In [10]:
#pipe delimited sample data
reads = pd.read_table('https://www.nrc.gov/reading-rm/doc-collections/event-status/reactor-status/2009/2009PowerStatus.txt')
reads.head()

                 ReportDt|Unit|Power
0  12/31/2009|Arkansas Nuclear 1|100
1  12/31/2009|Arkansas Nuclear 2|100
2     12/31/2009|Beaver Valley 1|100
3     12/31/2009|Beaver Valley 2|100
4         12/31/2009|Braidwood 1|100

In [11]:
#Pipe Separator 
reads = pd.read_table('https://www.nrc.gov/reading-rm/doc-collections/event-status/reactor-status/2009/2009PowerStatus.txt', sep='|')
reads.head()

     ReportDt                Unit  Power
0  12/31/2009  Arkansas Nuclear 1    100
1  12/31/2009  Arkansas Nuclear 2    100
2  12/31/2009     Beaver Valley 1    100
3  12/31/2009     Beaver Valley 2    100
4  12/31/2009         Braidwood 1    100

In [12]:
#tsv
employee = pd.read_table('DataTablesExample_TSV.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [13]:
#choose certain columns
cols=['Name','Position']
employee = pd.read_table('DataTablesExample_TSV.tsv')
employee[cols].head()

             Name                       Position
0      Airi Satou                     Accountant
1  Angelica Ramos  Chief Executive Officer (CEO)
2      Ashton Cox        Junior Technical Author
3   Bradley Greer              Software Engineer
4  Brenden Wagner              Software Engineer

In [14]:
#choose certain rows
employee = pd.read_table('DataTablesExample_TSV.tsv', nrows = 4)
employee

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"

# Data types

In [15]:
#display datatypes
employee = pd.read_table('DataTablesExample_TSV.tsv')
employee.dtypes

Name          object
Position      object
Office        object
Age            int64
Start date    object
Salary        object
dtype: object

In [16]:
#display integer datatypes
import numpy as np

employee = pd.read_table('DataTablesExample_TSV.tsv')
employee.select_dtypes(include = [np.number]).dtypes

Age    int64
dtype: object

# Basic Inbuilt methods for data analysis

In [17]:
employee.describe() #statistics with int

             Age
count  57.000000
mean   42.736842
std    14.877507
min    19.000000
25%    30.000000
50%    42.000000
75%    56.000000
max    66.000000

In [18]:
employee.shape #number of rows and columns

(57, 6)

In [19]:
type(employee) #type of object

pandas.core.frame.DataFrame

In [ ]:
# Comparing operations in SQL

In [20]:
employee = pd.read_table('DataTablesExample_TSV.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [21]:
employee['Name Salary']=employee['Name']+employee['Salary'] #concatinating 2 columns
employee.head()

,Name,Position,Office,Age,Start date,Salary,Name Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700","Airi Satou$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000","Angelica Ramos$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000","Ashton Cox$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000","Bradley Greer$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850","Brenden Wagner$206,850"

In [22]:
employee.drop('Office', axis=1, inplace=True) #remove column
employee.head()

,Name,Position,Age,Start date,Salary,Name Salary
0,Airi Satou,Accountant,33,2008/11/28,"$162,700","Airi Satou$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),47,2009/10/09,"$1,200,000","Angelica Ramos$1,200,000"
2,Ashton Cox,Junior Technical Author,66,2009/01/12,"$86,000","Ashton Cox$86,000"
3,Bradley Greer,Software Engineer,41,2012/10/13,"$132,000","Bradley Greer$132,000"
4,Brenden Wagner,Software Engineer,28,2011/06/07,"$206,850","Brenden Wagner$206,850"

In [23]:
employee = pd.read_table('DataTablesExample_TSV.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [24]:
cols =['Name','Posistion', 'Ofc','Age','SDate','Sal'] #renaming column
employee.columns = cols
employee.head()

,Name,Posistion,Ofc,Age,SDate,Sal
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [26]:
employee = pd.read_table('DataTablesExample_TSV.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [27]:
employee.sort_values(by='Age', ascending=True).head() #sorting Data

,Name,Position,Office,Age,Start date,Salary
48,Tatyana Fitzpatrick,Regional Director,London,19,2010/03/17,"$385,750"
45,Shou Itou,Regional Marketing,Tokyo,20,2011/08/14,"$163,000"
7,Caesar Vance,Pre-Sales Support,New York,21,2011/12/12,"$106,450"
32,Lael Greer,Systems Administrator,London,21,2009/02/27,"$103,500"
18,Gavin Cortez,Team Leader,San Francisco,22,2008/10/26,"$235,500"

In [28]:
employee['Name'].sort_values() #sort by name. Method 2

0              Airi Satou
1          Angelica Ramos
2              Ashton Cox
3           Bradley Greer
4          Brenden Wagner
5      Brielle Williamson
6              Bruno Nash
7            Caesar Vance
8            Cara Stevens
9            Cedric Kelly
10        Charde Marshall
11          Colleen Hurst
12               Dai Rios
13           Donna Snider
14           Doris Wilder
15           Finn Camacho
16            Fiona Green
17        Garrett Winters
18           Gavin Cortez
19            Gavin Joyce
20          Gloria Little
21          Haley Kennedy
22        Hermione Butler
23        Herrod Chandler
24           Hope Fuentes
25        Howard Hatfield
26       Jackson Bradshaw
27            Jena Gaines
28       Jenette Caldwell
29        Jennifer Acosta
30         Jennifer Chang
31        Jonas Alexander
32             Lael Greer
33         Martena Mccray
34          Michael Bruce
35          Michael Silva
36         Michelle House
37           Olivia Liang
38              Paul Byrd
39      Prescott Bartlett
40            Quinn Flynn
41         Rhona Davidson
42        Sakura Yamamoto
43          Serge Baldwin
44            Shad Decker
45              Shou Itou
46            Sonya Frost
47             Suki Burks
48    Tatyana Fitzpatrick
49            Thor Walton
50            Tiger Nixon
51         Timothy Mooney
52           Unity Butler
53         Vivian Harrell
54             Yuri Berry
55          Zenaida Frank
56         Zorita Serrano
Name: Name, dtype: object

In [29]:
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [30]:
employee[employee.Age<25] #filtering - where clause

,Name,Position,Office,Age,Start date,Salary
7,Caesar Vance,Pre-Sales Support,New York,21,2011/12/12,"$106,450"
9,Cedric Kelly,Senior Javascript Developer,Edinburgh,22,2012/03/29,"$433,060"
14,Doris Wilder,Sales Assistant,Sydney,23,2010/09/20,"$85,600"
18,Gavin Cortez,Team Leader,San Francisco,22,2008/10/26,"$235,500"
32,Lael Greer,Systems Administrator,London,21,2009/02/27,"$103,500"
40,Quinn Flynn,Support Lead,Edinburgh,22,2013/03/03,"$342,000"
45,Shou Itou,Regional Marketing,Tokyo,20,2011/08/14,"$163,000"
46,Sonya Frost,Software Engineer,Edinburgh,23,2008/12/13,"$103,600"
48,Tatyana Fitzpatrick,Regional Director,London,19,2010/03/17,"$385,750"

In [31]:
employee[(employee.Age<25) & (employee.Name == 'Shou Itou')] # multiple filtering criteria - where clause - and

         Name            Position Office  Age  Start date    Salary
45  Shou Itou  Regional Marketing  Tokyo   20  2011/08/14  $163,000

In [32]:
cols = ['Name' , 'Position']
employee[employee.Age<25][cols].head()

            Name                     Position
7   Caesar Vance            Pre-Sales Support
9   Cedric Kelly  Senior Javascript Developer
14  Doris Wilder              Sales Assistant
18  Gavin Cortez                  Team Leader
32    Lael Greer        Systems Administrator

# Manipulations and Aggregations

In [33]:
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [34]:
employee.mean() #mean

Age    42.736842
dtype: float64

In [35]:
employee.Name.str.upper().head() #upper case

0        AIRI SATOU
1    ANGELICA RAMOS
2        ASHTON COX
3     BRADLEY GREER
4    BRENDEN WAGNER
Name: Name, dtype: object

In [36]:
employee.Name.str.lower().head() #lower Case

0        airi satou
1    angelica ramos
2        ashton cox
3     bradley greer
4    brenden wagner
Name: Name, dtype: object

In [53]:
employee.Name.str.len().head() #length

0    10
1    14
2    10
3    13
4    14
Name: Name, dtype: int64

In [39]:
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [37]:
employee.Position.str.contains('Software') # contains - search records with words

0     False
1     False
2     False
3      True
4      True
5     False
6      True
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46     True
47    False
48    False
49    False
50    False
51    False
52    False
53    False
54    False
55     True
56     True
Name: Position, dtype: bool

In [38]:
employee[employee.Position.str.contains('Software')] #where position contains

,Name,Position,Office,Age,Start date,Salary
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"
6,Bruno Nash,Software Engineer,London,38,2011/05/03,"$163,500"
46,Sonya Frost,Software Engineer,Edinburgh,23,2008/12/13,"$103,600"
55,Zenaida Frank,Software Engineer,New York,63,2010/01/04,"$125,250"
56,Zorita Serrano,Software Engineer,San Francisco,56,2012/06/01,"$115,000"

In [40]:
employee.Position.str.replace('Engineer','Developer') #replace

0                        Accountant
1     Chief Executive Officer (CEO)
2           Junior Technical Author
3                Software Developer
4                Software Developer
5            Integration Specialist
6                Software Developer
7                 Pre-Sales Support
8                   Sales Assistant
9       Senior Javascript Developer
10                Regional Director
11             Javascript Developer
12                   Personnel Lead
13                 Customer Support
14                  Sales Assistant
15                Support Developer
16    Chief Operating Officer (COO)
17                       Accountant
18                      Team Leader
19                        Developer
20            Systems Administrator
21        Senior Marketing Designer
22                Regional Director
23                  Sales Assistant
24                        Secretary
25                   Office Manager
26                         Director
27                   Office Manager
28                 Development Lead
29      Junior Javascript Developer
30                Regional Director
31                        Developer
32            Systems Administrator
33               Post-Sales support
34             Javascript Developer
35               Marketing Designer
36           Integration Specialist
37                Support Developer
38    Chief Financial Officer (CFO)
39                 Technical Author
40                     Support Lead
41           Integration Specialist
42                Support Developer
43                 Data Coordinator
44                Regional Director
45               Regional Marketing
46               Software Developer
47                        Developer
48                Regional Director
49                        Developer
50                 System Architect
51                   Office Manager
52               Marketing Designer
53             Financial Controller
54    Chief Marketing Officer (CMO)
55               Software Developer
56               Software Developer
Name: Position, dtype: object

In [41]:
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

# Aggregation

In [42]:
employee.Age.min()

19

In [43]:
employee.Age.max()

66

In [44]:
employee.groupby('Position').Age.min() #group by

Position
Accountant                       33
Chief Executive Officer (CEO)    47
Chief Financial Officer (CFO)    64
Chief Marketing Officer (CMO)    40
Chief Operating Officer (COO)    48
Customer Support                 27
Data Coordinator                 64
Developer                        30
Development Lead                 30
Director                         65
Financial Controller             62
Integration Specialist           37
Javascript Developer             29
Junior Javascript Developer      43
Junior Technical Author          66
Marketing Designer               47
Office Manager                   30
Personnel Lead                   35
Post-Sales support               46
Pre-Sales Support                21
Regional Director                19
Regional Marketing               20
Sales Assistant                  23
Secretary                        41
Senior Javascript Developer      22
Senior Marketing Designer        43
Software Engineer                23
Support Engineer                 37
Support Lead                     22
System Architect                 61
Systems Administrator            21
Team Leader                      22
Technical Author                 27
Name: Age, dtype: int64

In [45]:
employee.groupby('Position').Age.agg(['count','min','max']) #set of aggregation

                               count  min  max
Position
Accountant                         2   33   63
Chief Executive Officer (CEO)      1   47   47
Chief Financial Officer (CFO)      1   64   64
Chief Marketing Officer (CMO)      1   40   40
Chief Operating Officer (COO)      1   48   48
Customer Support                   1   27   27
Data Coordinator                   1   64   64
Developer                          4   30   61
Development Lead                   1   30   30
Director                           1   65   65
Financial Controller               1   62   62
Integration Specialist             3   37   61
Javascript Developer               2   29   39
Junior Javascript Developer        1   43   43
Junior Technical Author            1   66   66
Marketing Designer                 2   47   66
Office Manager                     3   30   51
Personnel Lead                     1   35   35
Post-Sales support                 1   46   46
Pre-Sales Support                  1   21   21
Regional Director                  5   19   51
Regional Marketing                 1   20   20
Sales Assistant                    3   23   59
Secretary                          1   41   41
Senior Javascript Developer        1   22   22
Senior Marketing Designer          1   43   43
Software Engineer                  6   23   63
Support Engineer                   3   37   64
Support Lead                       1   22   22
System Architect                   1   61   61
Systems Administrator              2   21   59
Team Leader                        1   22   22
Technical Author                   1   27   27

# Pandas working with text data

In [ ]:
#Series - type

In [46]:
pd.Series(['a', 'b', 'c']) #object dt is str or mixed

0    a
1    b
2    c
dtype: object

In [48]:
pd.Series(['a', 'b', 'c'], dtype="str")

0    a
1    b
2    c
dtype: object

In [50]:
s = pd.Series(['a', 'b', 'c'])

In [52]:
s.astype("str")

0    a
1    b
2    c
dtype: object

In [ ]:
#strip

In [55]:
idx = pd.Index([' jack', 'jill ', ' jesse ', 'frank'])

In [56]:
idx.str.strip()

Index(['jack', 'jill', 'jesse', 'frank'], dtype='object')

In [57]:
idx.str.lstrip()

Index(['jack', 'jill ', 'jesse ', 'frank'], dtype='object')

In [58]:
idx.str.rstrip()

Index([' jack', 'jill', ' jesse', 'frank'], dtype='object')

In [ ]:
split

In [62]:
s2 = pd.Series(['a_b_c', 'c_d_e', np.nan, 'f_g_h'], dtype="str")
s2.str.split('_') #split

0    [a, b, c]
1    [c, d, e]
2          NaN
3    [f, g, h]
dtype: object

In [63]:
s2.str.split('_').str.get(1) #split, get 1st index

0      b
1      d
2    NaN
3      g
dtype: object

In [64]:
s2.str.split('_').str[1] #split, get 1st index - str object

0      b
1      d
2    NaN
3      g
dtype: object

In [65]:
s2.str.split('_', expand=True) #str with expand

     0    1    2
0    a    b    c
1    c    d    e
2  NaN  NaN  NaN
3    f    g    h

In [66]:
s2.str.split('_', expand=True, n=1)

     0    1
0    a  b_c
1    c  d_e
2  NaN  NaN
3    f  g_h

In [67]:
s2.str.rsplit('_', expand=True, n=1)

     0    1
0  a_b    c
1  c_d    e
2  NaN  NaN
3  f_g    h

In [ ]:
replace

In [69]:
s3 = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca','', np.nan, 'CABA', 'dog', 'cat'],dtype="str")
s3

0       A
1       B
2       C
3    Aaba
4    Baca
5
6     NaN
7    CABA
8     dog
9     cat
dtype: object

In [70]:
s3.str.replace('^.a|dog', 'XX-XX ', case=False) #regex

0           A
1           B
2           C
3    XX-XX ba
4    XX-XX ca
5
6         NaN
7    XX-XX BA
8      XX-XX
9     XX-XX t
dtype: object

In [72]:
# Consider the following badly formatted financial data
dollars = pd.Series(['12', '-$10', '$10,000'], dtype="str")
dollars

0         12
1       -$10
2    $10,000
dtype: object

In [73]:
dollars.str.replace('$', '')

0        12
1       -10
2    10,000
dtype: object

In [74]:
dollars.str.replace('-$', '-')

0         12
1       -$10
2    $10,000
dtype: object

In [75]:
dollars.str.replace(r'-\$', '-')

0         12
1        -10
2    $10,000
dtype: object

In [ ]:
#concat

In [80]:
s = pd.Series(['a', 'b', 'c', 'd'], dtype="str")
s

In [82]:
s.str.cat(sep=',')

'a,b,c,d'

In [83]:
s.str.cat()

'abcd'

In [84]:
t = pd.Series(['a', 'b', np.nan, 'd'], dtype="str")

In [85]:
t.str.cat(sep=',')

'a,b,d'

In [86]:
t.str.cat(sep=',', na_rep='-')

'a,b,-,d'

In [87]:
s

0    a
1    b
2    c
3    d
dtype: object

In [88]:
s.str.cat(['A', 'B', 'C', 'D'])

0    aA
1    bB
2    cC
3    dD
dtype: object

In [89]:
t

0      a
1      b
2    NaN
3      d
dtype: object

In [90]:
s.str.cat(t)

0     aa
1     bb
2    NaN
3     dd
dtype: object

In [91]:
s.str.cat(t, na_rep='-')

0    aa
1    bb
2    c-
3    dd
dtype: object

In [93]:
d = pd.concat([t, s], axis=1)
d

     0  1
0    a  a
1    b  b
2  NaN  c
3    d  d

In [94]:
u = pd.Series(['b', 'd', 'a', 'c'], index=[1, 3, 0, 2], dtype="str")
u

1    b
3    d
0    a
2    c
dtype: object

In [95]:
s

0    a
1    b
2    c
3    d
dtype: object

In [96]:
s.str.cat(u)

0    ab
1    bd
2    ca
3    dc
dtype: object

In [100]:
v = pd.Series(['z', 'a', 'b', 'd', 'e'], index=[-1, 0, 1, 3, 4], dtype="str")
v

-1    z
 0    a
 1    b
 3    d
 4    e
dtype: object

In [102]:
f = d.loc[[3, 2, 1, 0], :]
f

     0  1
3    d  d
2  NaN  c
1    b  b
0    a  a

In [ ]:
#extract

In [108]:
pd.Series(['a1', 'b2', 'c3'], dtype="str").str.extract(r'([ab])(\d)', expand=False)

     0    1
0    a    1
1    b    2
2  NaN  NaN

In [109]:
pd.Series(['a1', 'b2', 'c3'], dtype="str").str.extract(r'(?P<letter>[ab])(?P<digit>\d)',expand=False)

  letter digit
0      a     1
1      b     2
2    NaN   NaN

In [110]:
pd.Series(['a1', 'b2', '3'], dtype="str").str.extract(r'([ab])?(\d)', expand=False)

     0  1
0    a  1
1    b  2
2  NaN  3

In [112]:
pd.Series(['a1', 'b2', 'c3'], dtype="str").str.extract(r'[ab](\d)', expand=True)

     0
0    1
1    2
2  NaN

In [113]:
pd.Series(['a1', 'b2', 'c3'],dtype="str").str.extract(r'[ab](\d)', expand=False)

0      1
1      2
2    NaN
dtype: object

In [115]:
s = pd.Series(["a1", "b2", "c3"], ["A11", "B22", "C33"], dtype="str")
s.index.str.extract("(?P<letter>[a-zA-Z])", expand=True)

  letter
0      A
1      B
2      C

In [116]:
s.index.str.extract("(?P<letter>[a-zA-Z])", expand=False)
#s.index.str.extract("(?P<letter>[a-zA-Z])([0-9]+)", expand=False) --value err

Index(['A', 'B', 'C'], dtype='object', name='letter')

In [120]:
s = pd.Series(["a1a2", "b1", "c1"], index=["A", "B", "C"], dtype="str")
two_groups = '(?P<letter>[a-z])(?P<digit>[0-9])'
s.str.extract(two_groups, expand=True)

  letter digit
A      a     1
B      b     1
C      c     1

In [121]:
s.str.extractall(two_groups)

        letter digit
  match
A 0          a     1
  1          a     2
B 0          b     1
C 0          c     1

In [124]:
s = pd.Series(['a3', 'b3', 'c2'], dtype="str")
s

0    a3
1    b3
2    c2
dtype: object

In [126]:
s.str.extract(two_groups, expand=True)

  letter digit
0      a     3
1      b     3
2      c     2

In [128]:
s.str.extractall(two_groups)

        letter digit
  match
0 0          a     3
1 0          b     3
2 0          c     2

In [129]:
extractall_result.xs(0, level="match")

  letter digit
0      a     3
1      b     3
2      c     2

In [130]:
#Strings that match or contain a pattern

In [131]:
pattern = r'[0-9][a-z]'

In [132]:
pd.Series(['1', '2', '3a', '3b', '03c'], dtype="str").str.contains(pattern)

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [133]:
pd.Series(['1', '2', '3a', '3b', '03c'],dtype="str").str.match(pattern)

0    False
1    False
2     True
3     True
4    False
dtype: bool

In [135]:
pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'],dtype="str")

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [136]:
s4.str.contains('A', na=False)

0     True
1    False
2    False
3     True
4    False
5    False
6     True
7    False
8    False
dtype: bool

In [ ]:
#creating indicator variable

In [138]:
pd.Series(['a', 'a|b', np.nan, 'a|c'], dtype="str")

0      a
1    a|b
2    NaN
3    a|c
dtype: object

In [139]:
s.str.get_dummies(sep='|')

   a3  b3  c2
0   1   0   0
1   0   1   0
2   0   0   1

In [141]:
idx = pd.Index(['a', 'a|b', np.nan, 'a|c'])
idx

Index(['a', 'a|b', nan, 'a|c'], dtype='object')

In [142]:
idx.str.get_dummies(sep='|')

MultiIndex(levels=[[0, 1], [0, 1], [0, 1]],
           labels=[[1, 1, 0, 1], [0, 1, 0, 0], [0, 0, 0, 1]],
           names=['a', 'b', 'c'])

# LOC and Dropna

In [ ]:
#loc - choose number of rows and column

In [144]:
employee = pd.read_table('DataTablesExample_TSV.tsv')

employee.loc[0, :] #row 0, all col

Name          Airi Satou
Position      Accountant
Office             Tokyo
Age                   33
Start date    2008/11/28
Salary          $162,700
Name: 0, dtype: object

In [145]:
employee.loc[0:2, :] #row 0-2, all col

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"

In [146]:
employee.loc[0:2, ['Name','Position']] #row 0-2, 2 col

             Name                       Position
0      Airi Satou                     Accountant
1  Angelica Ramos  Chief Executive Officer (CEO)
2      Ashton Cox        Junior Technical Author

In [147]:
employee.loc[0:2, 'Name':'Office'] #Range in rows , Range in cols

             Name                       Position         Office
0      Airi Satou                     Accountant          Tokyo
1  Angelica Ramos  Chief Executive Officer (CEO)         London
2      Ashton Cox        Junior Technical Author  San Francisco

In [148]:
employee.loc[employee.Position == 'Accountant',:] #rows with condition - like where clause, all cols

               Name    Position Office  Age  Start date    Salary
0        Airi Satou  Accountant  Tokyo   33  2008/11/28  $162,700
17  Garrett Winters  Accountant  Tokyo   63  2011/07/25  $170,750

In [ ]:
#dropna - drop rows with missing values

In [149]:
employee = pd.read_table('dropnaExample_TSV.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,NaN
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,NaN
3,Bradley Greer,Software Engineer,London,41,2012/10/13,NaN
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [150]:
employee.shape

(57, 6)

In [151]:
employee.dropna(how='any').shape #drop rows with missing values in every # how - 'any' valure is missing

(54, 6)

In [154]:
employee.dropna(subset=['Name','Salary'], how='any').shape #drop rows with missing values in certain columns

(54, 6)

In [ ]:
#fillna

In [157]:
employee = pd.read_table('dropnaExample_TSV.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,NaN
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,NaN
3,Bradley Greer,Software Engineer,London,41,2012/10/13,NaN
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [159]:
(employee.fillna(0).head

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,0
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,0
3,Bradley Greer,Software Engineer,London,41,2012/10/13,0
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"
5,Brielle Williamson,Integration Specialist,New York,61,2012/12/02,"$372,000"
6,Bruno Nash,Software Engineer,London,38,2011/05/03,"$163,500"
7,Caesar Vance,Pre-Sales Support,New York,21,2011/12/12,"$106,450"
8,Cara Stevens,Sales Assistant,New York,46,2011/12/06,"$145,600"
9,Cedric Kelly,Senior Javascript Developer,Edinburgh,22,2012/03/29,"$433,060"
10,Charde Marshall,Regional Director,San Francisco,36,2008/10/16,"$470,600"
11,Colleen Hurst,Javascript Developer,San Francisco,39,2009/09/15,"$205,500"
12,Dai Rios,Personnel Lead,Edinburgh,35,2012/09/26,"$217,500"
13,Donna Snider,Customer Support,New York,27,2011/01/25,"$112,000"
14,Doris Wilder,Sales Assistant,Sydney,23,2010/09/20,"$85,600"
15,Finn Camacho,Support Engineer,San Francisco,47,2009/07/07,"$87,500"
16,Fiona Green,Chief Operating Officer (COO),San Francisco,48,2010/03/11,"$850,000"
17,Garrett Winters,Accountant,Tokyo,63,2011/07/25,"$170,750"
18,Gavin Cortez,Team Leader,San Francisco,22,2008/10/26,"$235,500"
19,Gavin Joyce,Developer,Edinburgh,42,2010/12/22,"$92,575"
20,Gloria Little,Systems Administrator,New York,59,2009/04/10,"$237,500"
21,Haley Kennedy,Senior Marketing Designer,London,43,2012/12/18,"$313,500"
22,Hermione Butler,Regional Director,London,47,2011/03/21,"$356,250"
23,Herrod Chandler,Sales Assistant,San Francisco,59,2012/08/06,"$137,500"
24,Hope Fuentes,Secretary,San Francisco,41,2010/02/12,"$109,850"
25,Howard Hatfield,Office Manager,San Francisco,51,2008/12/16,"$164,500"
26,Jackson Bradshaw,Director,New York,65,2008/09/26,"$645,750"
27,Jena Gaines,Office Manager,London,30,2008/12/19,"$90,560"
28,Jenette Caldwell,Development Lead,New York,30,2011/09/03,"$345,000"
29,Jennifer Acosta,Junior Javascript Developer,Edinburgh,43,2013/02/01,"$75,650"
30,Jennifer Chang,Regional Director,Singapore,28,2010/11/14,"$357,650"
31,Jonas Alexander,Developer,San Francisco,30,2010/07/14,"$86,500"
32,Lael Greer,Systems Administrator,London,21,2009/02/27,"$103,500"
33,Martena Mccray,Post-Sales support,Edinburgh,46,2011/03/09,"$324,050"
34,Michael Bruce,Javascript Developer,Singapore,29,2011/06/27,"$183,000"
35,Michael Silva,Marketing Designer,London,66,2012/11/27,"$198,500"
36,Michelle House,Integration Specialist,Sydney,37,2011/06/02,"$95,400"
37,Olivia Liang,Support Engineer,Singapore,64,2011/02/03,"$234,500"
38,Paul Byrd,Chief Financial Officer (CFO),New York,64,2010/06/09,"$725,000"
39,Prescott Bartlett,Technical Author,London,27,2011/05/07,"$145,000"
40,Quinn Flynn,Support Lead,Edinburgh,22,2013/03/03,"$342,000"
41,Rhona Davidson,Integration Specialist,Tokyo,55,2010/10/14,"$327,900"
42,Sakura Yamamoto,Support Engineer,Tokyo,37,2009/08/19,"$139,575"
43,Serge Baldwin,Data Coordinator,Singapore,64,2012/04/09,"$138,575"
44,Shad Decker,Regional Director,Edinburgh,51,2008/11/13,"$183,000"
45,Shou Itou,Regional Marketing,Tokyo,20,2011/08/14,"$163,000"
46,Sonya Frost,Software Engineer,Edinburgh,23,2008/12/13,"$103,600"
47,Suki Burks,Developer,London,53,2009/10/22,"$114,500"
48,Tatyana Fitzpatrick,Regional Director,London,19,2010/03/17,"$385,750"
49,Thor Walton,Developer,New York,61,2013/08/11,"$98,540"
50,Tiger Nixon,System Architect,Edinburgh,61,2011/04/25,"$320,800"
51,Timothy Mooney,Office Manager,London,37,2008/12/11,"$136,200"
52,Unity Butler,Marketing Designer,San Francisco,47,2009/12/09,"$85,675"
53,Vivian Harrell,Financial Controller,San Francisco,62,2009/02/14,"$452,500"
54,Yuri Berry,Chief Marketing Officer (CMO),New York,40,2009/06/25,"$675,000"
55,Zenaida Frank,Software Engineer,New York,63,2010/01/04,"$125,250"
56,Zorita Serrano,Software Engineer,San Francisco,56,2012/06/01,"$115,000"

In [155]:
milkprod = pd.read_csv('MonthlyMilkProduction.csv')
milkprod.head()

     Month  Monthly milk production (pounds per cow)
0  1962-01                                       589
1  1962-02                                       561
2  1962-03                                       640
3  1962-04                                       656
4  1962-05                                       727

In [156]:
milkprod.plot()

In [ ]:
#joins

#create dummy data
dataframe1 = pd.DataFrame({
    "employee":["ABC","XYZ","PQR"],
    "salary":["100000","125000","80000"]
})

dataframe1

In [ ]:
dataframe2 = pd.DataFrame({
    "employee":["ABC","XYZ","LMN"],
    "salary":["100000","125000","90000"]
})

dataframe2

In [ ]:
#inner join
dataframe3 = pd.merge(dataframe1,dataframe2, on='employee')
dataframe3

In [ ]:
#outer join
dataframe3 = pd.merge(dataframe1,dataframe2, on='employee', how='outer')
dataframe3

In [ ]:
#left join
dataframe3 = pd.merge(dataframe1,dataframe2, on='employee', how='left')
dataframe3

In [ ]:
#right join
dataframe3 = pd.merge(dataframe1,dataframe2, on='employee', how='right')
dataframe3

In [ ]:
#pivot
webtraffic = pd.read_csv('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/PivotExample.csv')
webtraffic

In [ ]:
webtraffic.pivot(index='Page_name', columns='Date')

In [ ]:
#Pivot table
webtraffic.pivot_table(index='Page_name', aggfunc='sum')

In [ ]:
#Pivot table
webtraffic.pivot_table(index='Page_name', aggfunc='mean')

In [ ]:
#Pivot table
webtraffic.pivot_table(index='Page_name', aggfunc='count')

In [ ]:
#shift
fb_finance = pd.read_csv('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/FB.csv')
fb_finance.head()

In [ ]:
fb_finance.shift(1).head()

In [ ]:
fb_finance.shift(-1).head()

In [ ]:
#calculate stock price delta
fb_finance['previous_closing_price']=fb_finance['Close'].shift(1)
fb_finance.head()

In [ ]:
fb_finance['previous_closing_price'] = fb_finance['previous_closing_price']-fb_finance['Close']
fb_finance.head()

In [ ]:
fb_finance['weekly returns'] = (fb_finance['Close']-fb_finance['Close'].shift(7))/fb_finance['Close']*100
fb_finance

In [ ]:
#write to csv
fb_finance.to_csv('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/FB.csv')

In [ ]:
#write to csv columns
fb_finance.to_csv('C:/Users/LocalAdmin/Documents/Python/Untitled Folder/FB.csv', columns=['Volume','weekly returns'])